Tekla Open API Reference for Tekla Structures 2025
Connection.SetSecondaryObject Method
 Sets the secondary object of the connection. Use this method if you wish to add only one secondary object to the connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetSecondaryObject(
	ModelObject M
)
Public Function SetSecondaryObject (
	M As ModelObject
) As Boolean
Parameters
M
Type: Tekla.Structures.Model.ModelObject
The secondary object.
Return Value
Type: Boolean
True on success.
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace